inference/inference-LEONARDO/results/vllm/sharegpt/Mistral-7B-Instruct-v0.3/Nodes_8-GPUs_32-TP_4-PP_1-MaxModelLength_4096/launch-1/logs_benchmarking_300-concurrency.log
INFO 04-02 10:06:07 [__init__.py:244] Automatically detected platform cuda.
Namespace(backend='vllm', base_url=None, host='localhost', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='sharegpt', dataset_path='/leonardo_work/MNRVA_bench/datasets/ShareGPT_V3_unfiltered_cleaned_split.json', max_concurrency=300, model='/leonardo_work/MNRVA_bench/models/Mistral-7B-Instruct-v0.3', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=1000, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, metadata=None, result_dir=None, result_filename='/leonardo_work/MNRVA_bench/minerva-benchmarks/inference/inference-LEONARDO/results/vllm/sharegpt/Mistral-7B-Instruct-v0.3/Nodes_8-GPUs_32-TP_4-PP_1-MaxModelLength_4096/launch-1/Concurrency_300.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, tokenizer_mode='auto')
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 300
============ Serving Benchmark Result ============
Successful requests:                     873       
Benchmark duration (s):                  28.49     
Total input tokens:                      176634    
Total generated tokens:                  198725    
Request throughput (req/s):              30.65     
Output token throughput (tok/s):         6976.04   
Total Token throughput (tok/s):          13176.60  
---------------Time to First Token----------------
Mean TTFT (ms):                          771.72    
Median TTFT (ms):                        720.52    
P99 TTFT (ms):                           1576.74   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          23.87     
Median TPOT (ms):                        23.20     
P99 TPOT (ms):                           52.63     
---------------Inter-token Latency----------------
Mean ITL (ms):                           22.38     
Median ITL (ms):                         20.54     
P99 ITL (ms):                            56.39     
==================================================